1. - Напишите функцию func(), которая при каждом своём вызове будет возвращать 
количество своих вызовов (сколько раз ее вызызвали до этого плюс этот вызов);




2. - Напишите функцию, которая будет увеличивать переменную let i = 0, от 0 до 20, 
при чём переменная будет увеличивать своё значение на еденицу каждые 2 секунды. 
Когда переменная станет равной 20, прекратить увеличение. 
Попробуйте реализовать через setInterval и через рекурсивный setTimeout.




3. - Напишите функцию startTimer(), которая будет запускать вывод через 
confirm("Реклама исчезнет счерез 5 секунд, вы согласны ?"),  при нажатии "ДА" выводите 
alert("Реклама") через 5 секунд, если нажали "НЕТ", то повторить вопрос
confirm("Реклама исчезнет счерез 5 секунд, вы согласны ?")
и так до тех пор, пока пользователь не нажмет "ДА" и не увидит эту рекламу через alert.