// - Используйте метод reduce в комбинации с concat для свёртки массива массивов 
// в один массив, у которого есть все элементы входных массивов.
// 	  Например:
// 		var arrays = [[1, 2, 3], [4, 5], [6]];
// 		// Ваш код тут
// 		// → [1, 2, 3, 4, 5, 6]	



//     - Создайте функцию-конструктор, которая позволяет создавать объект 
// пользователя с полями first_name, second_name, age, city.
// С помощью данной функции создайте два объекта пользователей (два пользователя), 
// имя, фамилию, возраст, город проживания задайте сами. 



//     - Создайте функцию, которая позовляет вывести полную информацию о каждом из двух 
// пользователей, созданных в предыдущем задании. Функция должна выполнять вывод информации 
// и не принимать аргументов. По сути нужно в одну функцию привязать два объекта. 